{"title": "Academic Grading", "heading": "# Academic Grading", "sections": [{"heading": "## Description of Grades", "content": "The Grade Point Average calculation ensures a continuous scale for the respective grades. The grade issued by the University will be final. Two types of averages will be computed for the grades obtained by each student, the Semester Grade Point Average (SGPA) and the Cumulative Grade Point Average (CGPA). SGPA is the weighted average of grade points earned in a semester. The weights are taken as the ratio of course credits to the total credits taken by the student in the semester.\n\nSGPA is the weighted average of grade points earned in a semester. The weights are taken as the ratio of course credits to the total credits taken by the student in the semester.\n\nCGPA is the weighted average of all the courses taken so far. For repeat courses, only the most recent grade points are used, even if they are less than the earlier attempts.\n\nThe following points need to be noted:\n\n- \"W\" will appear as a grade in the transcript like any other grade.\n- \"I\" will appear as a temporary grade in the transcript subject to change to the grade awarded. Grade “I” shall automatically convert to an “F” grade before the end of the next semester.\n\nRepeat courses will be indicated on the transcript together with the repeat count.\n\n\"S\" or \"U\" is awarded for PhD Thesis work only and is not considered in CGPA calculation.", "tokens": 232}, {"heading": "## Letter Code Interpretation", "content": "Letter grades for BBA & BS programs\n\n| Grade | Points | Interpretation |\n| :-- | :-- | :-- |\n| A+ | 4.00 | Excellent |\n| A | 4.00 | Excellent |\n| A- | 3.67 | Very Good |\n| B+ | 3.33 | Very Good |\n| B | 3.00 | Good |\n| B- | 2.67 | Average |\n| C+ | 2.33 | Below Average |\n| C | 2.00 | Adequate |\n| C- | 1.67 | Pass |\n| D+ | 1.33 | Pass |\n| D | 1.00 | Pass |\n\nLetter grades for MBA & MS programs\n\n| Grade | Points | Interpretation |\n| :-- | :-- | :-- |\n| A+ | 4.00 | Excellent |\n| A | 4.00 | Excellent |\n| A- | 3.67 | Very Good |\n| B+ | 3.33 | Good |\n| B | 3.00 | Average |\n| B- | 2.67 | Below Average |\n| C+ | 2.33 | Adequate |\n| C | 2.00 | Pass |\n\nLetter grades for PhD programs\n\n| Grade | Points | Interpretation |\n| :-- | :-- | :-- |\n| A+ | 4.00 | Excellent |\n| A | 4.00 | Excellent |\n| A- | 3.67 | Very Good |\n| B+ | 3.33 | Good |\n| B | 3.00 | Average |\n| B- | 2.67 | Below Average |\n\nThe Following grades are common for all degree programs:\n\n| Grade | Points | Interpretation |\n| :-- | :-- | :-- |\n| CR | - | Continuing Research |\n| F | 0.00 | Fail |\n| FA | 0.00 | Faill (Attendance Shortage) |\n| I | - | Incomplete |\n| W | - | Withdrawn |\n\nGrades CR, I and W are not used in computing SGPA or the CGPA.", "tokens": 318}, {"heading": "## Warning/Probation", "content": "1. At the end of every semester (including the first semester and summer semesters), warning is issued provided the CGPA of a student is less than the minimum required for the degree program.\n2. A student with a warning cannot register in a subsequent semester without approval of the relevant Head of Department or any other senior faculty nominated by him.\n3. After each semester (including the summer or the first semester), if the CGPA of a student is less than the required minimum, the Warning Count increases by one.\n4. If Warning Count becomes three, the admission of student at the University is closed.\n5. If the CGPA equals or exceeds the required minimum, the Warning Count becomes zero.\n\n| Programs | Minimum CGPA required to avoid Warning |\n| :-- | :-- |\n| BBA/BS | 2.0 |\n| MBA/MS | 2.5 |\n| PhD | 3.0 |\n\nThe admission will be cancelledautomaticallyafter completion of maximum duration allowed to earn a degree.", "tokens": 164}, {"heading": "## Repeating a Course", "content": "A student can repeat a course if that course has not been passed or the student desires to improve his/her grade. A student must repeat all failed courses. Students under warning must repeat such passed courses, in which their GPA is less than the minimum CGPA required for their degree.\n\nFor example, MS students under warning (CGPA less than 2.50) must repeat courses in which their GPA is less than 2.50 (i.e. C or C- grade).", "tokens": 76}, {"heading": "## Incomplete Course", "content": "A student may request an extension in the final examination for genuine reasons subject to the following.\n\n1. An \"I\" grade will be given for the affected course provided he/she has satisfactorily met all other requirements for the course except the final examination.\n2. The \"I\" grade will be converted to appropriate grade before the end of next semester.\n\nFAST-House\n\nRohtas Road, G-9/4\n\nIslamabad - 44000", "tokens": 66}], "tokens": 856}
