{"title": "howToApply", "heading": "## How To Apply", "content": "1. Home\n2. Admissions\n3. How To Apply", "tokens": 8}
{"title": "howToApply", "heading": "## Admission Procedure", "content": "The procedure for admission is as follows:\n\n1. Admission Application Form must be filled online by following the instructions.Click Herefor Online Admission Application\n2. Applications received through post or by hand will not be accepted/entertained.\n3. The online system assigns a unique Application Reference Number (ARN) to each applicant, which must be noted for later use.\n4. Applicant will confirm that information entered in the Admission Application Form is correct.In case of incorrect information, the University has all the rights to cancel the application/admission without any fee refund.\n5. Applicant will deposit the Application Fee in the designated Bank.Fee is non-refundable/adjustable.\n6. Upon payment of the Application Processing Fee (and additional Admission Test Fee), the applicant will print his/herADMIT CARDbearing the applicant’sTEST ROLL NUMBER.\n7. The applicant should then visit the test campus on the specified date and time as mentioned on the Admit card.\n8. Admission of a student automatically stands cancelled if he or she fails in the required exam whose result was not available at the time of admission.", "tokens": 172}
{"title": "howToApply", "heading": "## NU Online Admission Test for Graduate programs", "content": "Information on various Admission Tests is available on the University’s admission web-siteadmissions.nu.edu.pk\n\nThe online admission test is taken on a computer. The candidate should be familiar with the use of mouse and the keyboard. Each candidate is given a different examination. The sections of a test (English, Analytical skills, Math etc) appear in a random sequence. Moreover, questions related to different topics also appear before the candidate in a random sequence. In each section, a candidate can move forward and backwards to review the responses selected. The candidate can change his or her response to any question within the current section.\n\nEach section of the admission test has a fixed duration. Each section is timed independently and time saved in one section is not carried forward to the next sections. At the end of the test, a summary of the results is displayed on screen. The duration of the Online Admission Test is between two and three hours.\n\nApplicants should reach the test centre on the date and time specified on the admit card. Latecomers will not be allowed to take the test. Applicants should not bring anything to the test centre except their Admit Cards. No applicant will be allowed to take the test without an endorsed Admit Card. The Admission Test is held at all campuses of the University (Karachi, Lahore, Islamabad, and Peshawar).\n\nClick Herefor Selection Criteria.", "tokens": 230}
{"title": "howToApply", "heading": "## Selected Candidates Announcement", "content": "The selected candidates are informed through SMS on their cell phones and also via email. The candidates should check the status of their admission from the University web siteadmissions.nu.edu.pkorwww.nu.edu.pk.", "tokens": 29}
{"title": "howToApply", "heading": "## Foreign Nationals", "content": "At the time of admission, foreign nationals must submit a No Objection Certificate (NOC) from the Ministry of Education, Government of Pakistan.\n\nThe procedure for admission is as follows:\n\n1. Admission Application Form must be filled online by following the instructions.Click Herefor Online Admission Application\n2. Applications received through post or by hand will not be accepted/entertained.\n3. The online system assigns a unique Application Reference Number (ARN) to each applicant, which must be noted for later use.\n4. Applicant will confirm that information entered in the Admission Application Form is correct.In case of incorrect information, the University has all the rights to cancel the application/admission without any fee refund.\n5. Admission of a student automatically stands cancelled if he or she fails in the required exam whose result was not available at the time of admission.", "tokens": 137}
{"title": "howToApply", "heading": "## Announcements of Selected Candidates", "content": "The selected candidates are informed through SMS on their cell phones and also via email. The candidates should check the status of their admission from the University web siteadmissions.nu.edu.pkorwww.nu.edu.pk.", "tokens": 29}
{"title": "howToApply", "heading": "## Foreign Nationals", "content": "At the time of admission, foreign nationals must submit a No Objection Certificate (NOC) from the Ministry of Education, Government of Pakistan.", "tokens": 22}
{"title": "howToApply", "heading": "## GRE and SAT Examinations", "content": "Those who have taken SAT examination can apply for admission to the undergraduate programs, i.e. BBA or BS.\n\nThose who have taken the GRE (subject test) can apply for admission to graduate programs, i.e. MS, MBA or PhD.\n\nClick here to Apply Online\n\nThe Institution code for receiving SAT scores is 4575\n\nThe Institution code for receiving GRE scores is 7386\n\nFAST-House\n\nRohtas Road, G-9/4\n\nIslamabad - 44000", "tokens": 68}
