{"title": "programsBS(CV)", "heading": "# programsBS(CV)", "sections": [{"heading": "## Bachelor of Science (Civil Engineering)", "content": "1. Home\n2. Admissions\n3. BS(CV) - Program Details\n\nThose who have taken the HSSC or an equivalent examination and are awaiting result are also eligible to apply.The four-year undergraduate programs of full time study are divided into eight semesters.\n\nThe Civil Engineering degree is based on the HEC/PEC approved curriculum. In the first year, the students learn the fundamentals of Civil Engineering supported by essential mathematics and physics courses. These courses are followed by breadth courses which introduce students to different aspects of Civil Engineering. In the senior year students choose a specialization stream and study advanced courses.\n\nIn the highly competitive job market a graduate engineer is not only required to be knowledgeable in technical areas but is also expected to have excellent communication skills and an appreciation of cost effective engineering solutions. Students are offered courses in communication skills to prepare them for challenging environments. Courses like Professional Ethics contribute towards enhancing soft skills that help prepare a well-rounded personality.\n\nThis degree program opens careers in different areas of Civil engineering.\n\nFor the award of BS (Civil Engineering) degree, a student must have:\n\n- Passed courses totaling at least 138 credit hours, including all those courses which have been specified as Core courses.\n- Obtained a CGPA of at least 2.00\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 1 |\n| 1 | CV1002 Engineering Drawing | 1+2 |\n| 2 | CV1001 Civil Engineering Materials | 2+1 |\n| 3 | EE1002 Basic Electro-Mechanical Engineering | 3+1 |\n| 4 | MT1001 Applied Calculus | 3+0 |\n| 5 | SS1005 English Language Skills | 2+0 |\n| 6 | SS1009 Pakistan Studies | 1+0 |\n| Total | 12 + 4 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 2 |\n| 1 | CV1003 Engineering Surveying | 2+1 |\n| 2 | MT1006 Differential Equations | 3+0 |\n| 3 | NS1004 Engineering Mechanics | 3+1 |\n| 4 | NS1003 Engineering Geology | 2+0 |\n| 5 | SS1007 Islamic Studies / Ethics | 2+0 |\n| 6 | CS1003 Computer Programming | 1+2 |\n| Total | 13 + 4 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 3 |\n| 1 | CV2002 Fluid Mechanics | 3+1 |\n| 2 | CV2001 Advanced Engineering Surveying | 2+1 |\n| 3 | CV2005 Mechanics of Solids - I | 2+1 |\n| 4 | MG2006 Construction Health, Safety and Environment | 1+0 |\n| 5 | SS2011 Technical Communication Skills | 2+0 |\n| 6 | SSxxxx Social Sciences - I | 2+0 |\n| 7 | MGxxxx Management Sciences Elective | 1+0 |\n| Total | 13 + 3 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 4 |\n| 1 | CV2006 Structural Analysis - I | 3+0 |\n| 2 | CVxxxx Civil Engineering Graphics and Construction | 1+2 |\n| 3 | MT2006 Probability and Statistics | 2+0 |\n| 4 | CVxxxx Quantity Surveying and Estimation | 1+1 |\n| 5 | MT2007 Numerical Analysis | 3+0 |\n| 6 | SS2009 Technical Report Writing and Presentation | 0+1 |\n| 7 | MG2002 Engineering Economics | 2+0 |\n| 8 | SSxxxx Social Sciences - II | 2+0 |\n| Total | 14 + 4 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 5 |\n| 1 | CV3001 Advanced Fluid Mechanics | 3+1 |\n| 2 | CV3009 Hydrology and Water Management | 3+1 |\n| 3 | CV4002 Architecture and Town Planning | 2+0 |\n| 4 | CV3002 Plain and Reinforced Concrete - I | 3+1 |\n| 5 | CV2003 Soil Mechanics | 3+1 |\n| Total | 14 + 4 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 6 |\n| 1 | CV4005 Steel Structures | 3+0 |\n| 2 | CV3008 Structural Analysis - II | 3+0 |\n| 3 | CV3006 Environmental Engg. - I | 2+0 |\n| 4 | CV3004 Transportation Planning & Engineering | 3+0 |\n| 5 | CV3007 Mechanics of Solids-II | 2+1 |\n| 6 | CV4007 Geotechnical and Foundation Engg. | 3+1 |\n| Total | 16 + 2 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 7 |\n| 1 | CV4003 Plain and Reinforced Concrete - II | 3+1 |\n| 2 | CV4004 Highway and Traffic Engineering | 3+1 |\n| 3 | CV3008 Environmental Engineering - II | 2+1 |\n| 4 | CV4008 Fundamentals of Dynamics and its Applications | 2+0 |\n| 5 | NL4001 Geo Informatics - Lab | 0+1 |\n| 6 | VL4013 Introduction to Machine Learning | 0+1 |\n| 7 | CV4091 Final Year Project - I | 0+3 |\n| Total | 10 + 8 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 8 |\n| 1 | CV4003 Construction Engineering and Management | 2+1 |\n| 2 | CV4010 Design of Structures | 2+1 |\n| 3 | CV4009 Hydraulic Engineering | 2+1 |\n| 4 | CV4011 Irrigation and Drainage Engineering | 2+1 |\n| 5 | SS2004 Engineering Ethics | 1+0 |\n| 6 | CLxxxx Building Information Modeling Lab | 0+1 |\n| 7 | CV4092 Final Year Project-II | 0+3 |\n| Total | 9 + 8 |\n\n| Domain | Cr. Hrs |\n| :-- | :-- |\n| Civil Engineering Core | 91 |\n| Natural Science | 8 |\n| Social Sciences | 13 |\n| Other Engineering | 4 |\n| Mathematics | 11 |\n| Management Sciences | 7 |\n| Computer Programming | 4 |\n| Total | 138 |\n\nNote 1:Total:138Note 2:Registration in “Project-I” is allowed provided the student has\n\n    earned at least 130 credit hours, and his/her CGPA is equal to or greater than the graduating CGPA (2.0).\n\nNote 1:Total:138\n\nNote 2:Registration in “Project-I” is allowed provided the student has\n\n    earned at least 130 credit hours, and his/her CGPA is equal to or greater than the graduating CGPA (2.0).\n\n1. Successfully engage in contemporary civil engineering practice to solve real-world problems.\n2. Pursue professional growth through continuous learning and experience.\n3. Maintain high ethical standards in the conduct of professional practice.\n4. Attain increasing level of responsibility with interpersonal and communication skills.\n\n1. Engineering Knowledge - An ability to apply knowledge of mathematics, science, engineering fundamentals and an engineering specialization to the solution of complex engineering problems.\n2. Problem Analysis - An ability to identify, formulate, research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences.\n3. Design / Development of Solutions - An ability to design solutions for complex engineering problems and design systems, components or processes that meet specified needs with appropriate consideration for public health and safety, cultural, societal, and environmental considerations.\n4. Investigation - An ability to investigate complex engineering problems in a methodical way including literature survey, design and conduct of experiments, analysis and interpretation of experimental data, and synthesis of information to derive valid conclusions.\n5. Modern Tool Usage - An ability to create, select and apply appropriate techniques, resources, and modern engineering and IT tools, including prediction and modeling, to complex engineering activities, with an understanding of the limitations.\n6. Engineer and Society\t- An ability to apply reasoning informed by contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to professional engineering practice and solution to complex engineering problems.\n7. Environment and Sustainability - An ability to understand the impact of professional engineering solutions in societal and environmental contexts and demonstrate knowledge of and need for sustainable development.\n8. Ethics - Apply ethical principles and commit to professional ethics and responsibilities and norms of engineering practice.\n9. Individual and Team Work - An ability to work effectively, as an individual or in a team, on multifaceted and /or multidisciplinary settings.\n10. Communication - An ability to communicate effectively, orally as well as in writing, on complex engineering activities with the engineering community and with society at large, such as being able to comprehend, write effective reports, design documentation, make effective presentations, and give/receive clear instructions.\n11. Project Management - An ability to demonstrate management skills and apply engineering principles to one’s own work, as a member and/or leader in a team, to manage projects in a multidisciplinary environment.\n12. Lifelong Learning - An ability to recognize importance of, and pursue lifelong learning in the broader context of innovation and technological developments.\n\nFAST-House\n\nRohtas Road, G-9/4\n\nIslamabad - 44000", "tokens": 1523}], "tokens": 1523}
