{"title": "programsMS(LING)", "heading": "# programsMS(LING)", "sections": [{"heading": "## Master of Science (Applied Linguistics)", "content": "1. Home\n2. Admissions\n3. MS(LING) - Program Details\n\nThere is an ever-growing demand of trained English teachers. Colleges, universities, and language schools, all need qualified English teachers. English has now become more than a mere language.It is a bridge across borders and cultures, and a source of unity in a rapidly evolving world.This program shall enable students to learn how linguistic analysis can be used in practice in the vast arena of Language with specializations in Computer Assisted Language Learning (CALL), Computational Linguistics (CL), English Language Teaching (ELT), and English for Specific Purposes (ESP). This program inculcates specialized skills to effectively perform teaching of English language. This program integrates Language and computing skills.\n\nFor Specialization and Research InfoClick Here\n\nProgram Objectives\n\n- To produce qualified teaching resource\n- To integrate ICT (Information and Communication Technologies) in Teaching of English Language\n- To develop collaborative e-learning resources for teaching\n- To encourage teachers to be critically engaged  in advanced research in English language teaching and learning\n\nAward of Degree\n\n- Passed courses totalling at least 30 credit hours, including all those courses which have been specified as Core courses\n- Obtained a CGPA of at least 2.5\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 1 |\n| 1 | Computer Assisted Language Learning | 3+0 |\n| 2 | Fundamentals of Languages & Linguistics | 3+0 |\n| 3 | Computational Linguistics | 3+0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 2 |\n| 1 | Research Methodology | 3+0 |\n| 2 | Specialist Module-I | 3+0 |\n| 3 | Elective-I | 3+0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 3 |\n| 1 | Thesis-I | 0+3 |\n| 2 | Specialist Module-II | 3+0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 4 |\n| 1 | Thesis-II | 0+3 |\n| 2 | Elective-III | 3+0 |\n\nNote:Registration in “Thesis-I” is allowed provided the student has:Earned at least 18 creditsPassed the \"Research Methodology\" courseCGPA is equal to or greater than the graduating CGPA (2.5)\n\nNote:Registration in “Thesis-I” is allowed provided the student has:\n\n- Earned at least 18 credits\n- Passed the \"Research Methodology\" course\n- CGPA is equal to or greater than the graduating CGPA (2.5)\n\nFAST-House\n\nRohtas Road, G-9/4\n\nIslamabad - 44000", "tokens": 429}], "tokens": 429}
