{"title": "programsMS(SPM)", "heading": "## Master of Science (Software Project Management)", "content": "1. Home\n2. Admissions\n3. MS(SPM) - Program Details\n\nThis program enables students to develop skills necessary to manage software projects. In the final year, students take two-semester Project, which involves practical implementation of Project Management skills and techniques acquired through the program, as well as actual development of the project.\n\nThe MS (Software Project Management) program focuses on strengthening students’ knowledge in theoretical as well as practical aspects of managing software projects. The program not only addresses management issues related to software industry but also covers the software engineering concepts, which must be known to a project manager.\n\nThe aim is to prepare middle and top management so that they meet the challenges of present and future needs of software industry. The coursework exposes the students to management and technical issues encountered in development of software solutions.\n\nTypical course load in a semester is four courses. However, NUCES staff cannot register for more than two courses in a semester.\n\nFor the award of MS degree, a student must have:\n\n- Passed courses totalling at least 30 credit hours, including all those courses which have been specified as Core courses\n- Obtained a CGPA of at least 2.5\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 1 |\n| 1 | Research Methodology | 3+0 |\n| 2 | Software Project Management | 3+0 |\n| 3 | Management & Org. Behaviour | 3+0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 2 |\n| 1 | Software Quality Assurance | 3+0 |\n| 2 | Software Process Management & Metrics | 3+0 |\n| 3 | Requirements Engineering | 3+0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 3 |\n| 1 | Computing Elective | 3+0 |\n| 2 | MS Thesis-I/MS Project-I/Practicum-1 | 0+3 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 4 |\n| 1 | General Elective – I(Computing / MG) | 3+0 |\n| 2 | MS Thesis-II/MS Project-II/Practicum-II | 0+3 |\n\nNote 1:Applied Programming course is of No Credit (NC), but it must be passed.Note 2:Registration in “MS Thesis - I” is allowed provided the student has:Earned at least 15 creditsPassed the “Research Methodology” courseCGPA is equal to or more than 2.5\n\nNote 1:Applied Programming course is of No Credit (NC), but it must be passed.\n\nNote 2:Registration in “MS Thesis - I” is allowed provided the student has:\n\n- Earned at least 15 credits\n- Passed the “Research Methodology” course\n- CGPA is equal to or more than 2.5\n\n1. To prepare the students to assess and manage risks by developing strategies to handle them.\n2. To enable students to gather and manage requirements, and provide effective coordination between relevant stakeholders.\n3. To help students in identifying, documenting and analyzing change management to agreeing on changes to scope.\n4. To prepare students for configuration management of large scale software.\n5. To enable students in identifying, prioritizing and agreeing on software releases by preparing release schedules by estimating software costs and resource requirements.\n6. To acquire students with the ability to identify and resolve conflicts that may arise during the management of software projects.\n7. Inculcate a sense of ethics, responsibilities and leadership.\n\n1. Students will be able to exhibit expertise in managing large-scale projects as their final year project or conduct research related to Software Project management.\n2. Students will demonstrate analytical and communication skills while exhibiting project resource forecasting abilities and quality implementation for successful completion of the project.\n3. Students will develop skills to understand and implement industry adopted standards and calculate and examine project and process metrics.\n4. Demonstrate effective organizational leadership skills concerning project teams and stakeholders.\n\nFAST-House\n\nRohtas Road, G-9/4\n\nIslamabad - 44000", "tokens": 663}
