{"title": "programsMS(EE)", "heading": "## Master of Science (Electrical Engineering)", "content": "1. Home\n2. Admissions\n3. MS(EE) - Program Details\n\nThe purpose of the MS program in Electrical Engineering is to attain theoretical and practical depth in one of the\n\n    areas of interest.The MS(EE) program is structured in such a way as to enhance the student's critical thinking\n\n    and intuitive abilities using a combination of highly specialized courses and expert supervision. The program\n\n    aims to produce graduates who will have the abilities and skills to be employed as practicing engineers in fields\n\n    such as design, research, development, testing, and manufacturing, as well as assuming positions of leadership\n\n    and responsibility within organizations.\n\nThree options:6-credit hour Thesis or 3 credit hour Project with one additional elective or MS by course work.\n\nTypical course load in a semester is four courses. However, NUCES staff cannot register for more than two courses in a semester.\n\nFor the award of MS degree, a student must have:\n\n- Passed courses totalling at least 30 credit hours, including THREE Core courses\n- Obtained a CGPA of at least 2.5\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 1 |\n| 1 | EExxxx Core Course-I | 3+0 |\n| 2 | EExxxx Core Course-II | 3+0 |\n| 3 | EE5011 Research Methodology | 3+0 |\n| Total | 9 + 0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 2 |\n| 1 | EExxxx Core Course-III | 3+0 |\n| 2 | EExxxx Elective-I | 3+0 |\n| 3 | EExxxx Elective-II | 3+0 |\n| Total | 9 + 0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 3 |\n| 1 | EExxxx Elective-III | 3+0 |\n| 2 | EE5091 MS Thesis-I/Elective-IV | 0+3 |\n| Total | 3 + 3 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 4 |\n| 1 | EExxxx Elective-V | 3+0 |\n| 2 | EE5092 MS Thesis-II/MS Project/Elective-VI | 0+3 |\n| Total | 3 + 3 |\n\nCore Courses for Electrical Engineering:(Any THREE of the following courses must be passed)\n\n- CS5012 Adv. Computer Networks\n- EE5106 Adv. Digital Signal Processing\n- EE5043 Adv. Embedded Systems and Networks\n- EE5023 Analog & Discrete Electronics\n- EE5035 Engineering Optimization\n\n- EE5014 Linear Systems\n- EE5033 Power System Modelling & Analysis\n- EE5012 Random Variable and Stochastic Processes\n- EE5045 Applied Electromagnetics\n\nCourses for Computer Systems Stream:\n\n- AI5XXX Computational Statistics (core)\n- EE5043 Adv. Embedded Systems and Networks (core)\n- IO5031 Internet of Things\n- CS5042 Advanced Network Security\n\n- EE5035 Engineering Optimization (core)\n- AI5003 Advanced Machine Learning\n- DS5006 Deep Learning\n\nNote 1:Registration in “MS Thesis - I” is allowed provided the student has:Earned at least 15 creditsPassed the “Research Methodology” courseCGPA is equal to or more than 2.5\n\nNote 1:Registration in “MS Thesis - I” is allowed provided the student has:\n\n- Earned at least 15 credits\n- Passed the “Research Methodology” course\n- CGPA is equal to or more than 2.5\n\n1. Provide students with advanced learning and application in a discipline or sub-discipline of electrical engineering. (Application to be added)\n2. Teach tools and techniques required for advanced learning, research and application in any discipline or sub-discipline of electrical engineering.\n3. Enhance skills such areas as problem-solving, mathematical modelling, writing & oral presentation, leadership, interrelation of business with technology and ethics as applied to electrical engineering.\n\n1. An ability to develop deeper theoretical and conceptual understanding of an area of concentration in electrical engineering.\n2. Identify, formulate, and solve problems using advanced engineering principles, methodologies and tools for design, analysis and research.\n3. Design, validate, develop and deploy a new component, device, system, or process according to a strategy, policy, implementation plan and assess the findings within the frame of quality processes within realistic constraints.\n4. Recognize the impact of electrical engineering problems independently & take responsibility to conceive competent solutions in a global, economic, environmental, societal and ethical context.\n5. Communicate their knowledge and findings professionally and effectively using qualitative and quantitative data.\n\nFAST-House\n\nRohtas Road, G-9/4\n\nIslamabad - 44000", "tokens": 718}
