{"title": "programsPhD(MS)", "heading": "## Doctor of Philosophy (Management Sciences)", "content": "1. Home\n2. Admissions\n3. PhD(MS) - Program Details\n\nThe PhD program provides high quality management education to business scholars i.e. to discover and impart\n\n    culturally and globally relevant knowledge in management sciences. The program is designed to discover management\n\n    scholarship which is intellectually rigorous, morally intensive, socially integrative, culturally relevant and\n\n    globally acknowledged. PhD scholars will be encouraged to carry out original work through research which connects\n\n    strongly with resolving local, national and global challenges of significance. PhD in Management is offered at\n\n    Islamabad at Lahore Campus.\n\nThe Islamabad Campus is currently offering PhD in the following areas of specialization:\n\n- Management\n- Marketing\n- Finance\n- Human Resource Management\n- Technology Management\n\n- A Master’s degree in a relevant subject, earned from a recognized university after a minimum of 18 years of\n\n        education with CGPA of at least 3.0/4.0 or equiva lent.\n- A minimum of 60% marks and at least 50 percentile rank in the relevant NTS subject test. The NTS GAT-Subject\n\n        Score should be valid at the time of admission.\n\nAdmission is based on a candidate’s performance in the following:\n\n- Performance in International GMAT or an equivalent test as per HEC rule\n- Interview and assessment by the Doctoral Admissions Committee (FSM DAC)\n- Submission of Research Proposal (for the purpose of evaluation)\n\nPublication of one research article in an HEC approved “W” category journalORTwo research articles in an HEC approved “X” category journal is a requirement for the award of PhD degree.\n\nThe PhD program requires candidates to take six graduate level courses (18 Cr. hrs.). There are four core courses,\n\n    listed below. The remaining two can be taken from graduate level courses in the Faculty of Management Sciences or\n\n    from the specialization electives for PhDs with the recommendation of the supervisor. On completion of the\n\n    coursework, students are required to pass a qualifying comprehensive examination, defend their research proposal and\n\n    then carry out research in the chosen area. The candidates are also required to publish research papers in journals\n\n    of international repute, as per prevalent requirements.\n\n| Title | Cr. hrs. | Title | Cr. hrs. |\n| :-- | :-- | :-- | :-- |\n| Philosophy of Management Science | 3 | Quantitative Methods in Management Research | 3 |\n| Research and Theory in Management | 3 | Qualitative Methods in Management Research | 3 |\n\nOutlines of Core Courses:(These are broad guidelines only. Instructors may vary emphases on\n\n    individual topics and themes and bring additional topics that they see fit)\n\nPhilosophy of Management Science (MG601):It is said that management is governing and leading without\n\n    recourse to political power or religious authority. This advanced level course will help students to realize and\n\n    appreciate the nature of management field to a greater maturity and sophistication by interchangeably addressing the\n\n    philosophical aspects of management and managerial aspects of philosophy. Accordingly, the process that will be used\n\n    will start with, and put major focus on, developing an understanding of the evolution of management and\n\n    organizational philosophy in a chronological order by classifying the work of central theorists and authors from a\n\n    perspective that clarifies their relevance with the mainstream theory building in the field of management. The idea\n\n    is to dissect the body of knowledge in management science – i.e., perspectives such as classical and neo-classical\n\n    organization theory, OB perspective, structural organization theory, systems theory and organizational economics,\n\n    power and politics, organizational culture and environment, and postmodernism, etc. – and interpret it as a\n\n    continuous effort to analyzing, predicting, controlling and governing human action.\n\nResearch and Theory in Management (MG604):A theory is said to be an ordered set of assertions about a\n\n    generic set of behavior that hold true for a wide range of specific instances. But where do new theories come from?\n\n    How theories are built starting from a very basic research question? And can theories be good or bad since once\n\n    popularized they not only explain behavior but influence behavior in a certain direction. Finally, what constitutes\n\n    a ‘weak’ or a ‘strong’ theory? The aim of this course is to develop a critical appreciation ofthe role of research\n\n    in theory development in Management as well as introducing doctoral students to the art and science of theory\n\n    construction and model building. Topics include examining the nature of being (ontology) and knowing (epistemology),\n\n    exploring the basic structure of argument and evidence, developing a pertinent and interesting research question,\n\n    defining constructs, imagining relationships and processes that link constructs, and linking and combining\n\n    constructs in an innovative way to develop new theories or build further upon existing behavioral models. This\n\n    course demands intensive preparation on part of students in terms of readings prior to the lectures so that lively\n\n    discussions can be generated in the classroom, research exercises tailored to each student’s research topic can be\n\n    accomplished, and a term paper be completed.\n\nQualitative Methods (MG 589):This course will introduce a range of qualitative research methods and the\n\n    means of assessing the key assumptions underlying the selection and use these methods. Building on the fundamental\n\n    questions about the nature of knowledge and whether \"true\" knowledge or reality can exist, the discussions will\n\n    provide a deep understanding of the advantages and challenges in carrying out qualitative research. Examples of\n\n    topics covered include interviews, focus groups, ethnography, documentary and textual analysis, discourse analysis,\n\n    language and conversation analysis, case-studies, participatory action research and grounded theory. Categorization\n\n    and coding of data will be covered in detail. The course will include labs to introduce software for qualitative\n\n    data analysis. The course will also cover the growing significance of qualitative research techniques across the\n\n    modern and postmodern era. Further, scholars will be encouraged to analyze and understand various approaches to\n\n    writing qualitative papers.\n\nQuantitative Methods (MG 548):This course will introduce a range of advance quantitative research technique\n\n    and develop an understanding of the potential and limitations of statistical analysis. Building on the positivist\n\n    paradigm, the course will briefly revise concepts of probability, sampling, hypothesis development, developing\n\n    constructs, associations and basic analyses for differences between groups. Examples of main topics covered include\n\n    various types of regression, discriminant analysis, MANOVA, analysis of covariance, principal component and factor\n\n    analysis, cluster analysis, structural equation modelling, survival/failure analysis and time series analysis. The\n\n    course will include labs to introduce software for quantitative data analysis. Scholars will be encouraged to\n\n    analyze and understand articles which have used a variety of quantitative methods, developing the capacity to choose\n\n    advance techniques suitable for their research questions.\n\n| 1 | Knowledge and Understanding | Demonstrate the ability to make a contribution to their specific field of study through original research that extends the frontier of knowledge by developing a substantial body of work, some of which merits international refereed publication. |\n| :-- | :-- | :-- |\n| 2 | Critical Review | Place critically the results of existing research work in the context of the research literature and make creative and expert use of a range of existing theories, techniques and tools relevant to their field of research. |\n| 3 | Societal and ethical impact | Be well informed of issues related to ethical conduct in science, and be able to engage in discussions on this topic both with their peers and the general public in an informed and reasoned fashion. |\n| 4 | Independent Research | Be able to set their own research agenda for the future, and to undertake a future career as an independent researcher in academia and industry. |\n| 5 | Communication Skills | Document and communicate the core issues, problem statements, evaluation reviews to produce an effective research article. |\n\n1\n\nKnowledge and Understanding\n\nDemonstrate the ability to make a contribution to their specific field of study through original research that extends the frontier of knowledge by developing a substantial body of work, some of which merits international refereed publication.\n\n2\n\nCritical Review\n\nPlace critically the results of existing research work in the context of the research literature and make creative and expert use of a range of existing theories, techniques and tools relevant to their field of research.\n\n3\n\nSocietal and ethical impact\n\nBe well informed of issues related to ethical conduct in science, and be able to engage in discussions on this topic both with their peers and the general public in an informed and reasoned fashion.\n\n4\n\nIndependent Research\n\nBe able to set their own research agenda for the future, and to undertake a future career as an independent researcher in academia and industry.\n\n5\n\nCommunication Skills\n\nDocument and communicate the core issues, problem statements, evaluation reviews to produce an effective research article.\n\nFAST-House\n\nRohtas Road, G-9/4\n\nIslamabad - 44000", "tokens": 1443}
