{"title": "programsMBA", "heading": "## Master of Business Administration", "content": "1. Home\n2. Admissions\n3. MBA - Program Details\n\n- Business Graduates and Managers to excel in combination of general management, leadership and functional\n\n        specialization\n- Engineers and Scientists, Doctors, Social Scientists, Lawyers, and professional graduates from Liberal Arts\n\n        disciplines etc. who choose a general management education over a strong functional specialization.\n\nThe FAST MBA is a degree program which comprises of 60 credit hours for those with 16 years of\n\n        education(Such as BBA, BS (Accounting & Finance), MA (Economics), Engineers, Scientist, Doctors,\n\n        Social scientists, Lawyers and professional graduates from Liberal Arts disciplines etc). It delivers an\n\n    in-depth understanding of the dynamics of management practices, and a deeper appreciation of the implications of a\n\n    rapidly globalizing work environment on businesses. It is designed with the flexibility to cater for the needs of\n\n    those who have their undergraduate degree in business related subjects, as well as for those who are coming from\n\n    other disciplines and are making a conversion to the business and management discipline by doing an MBA.\n\nThere are three distinguishing features of the FAST MBA. First, in line with the vision and mission of the business\n\n    school, the MBA is designed to keep a balance between local, regional and global knowledge, through integration of\n\n    local and international teaching material, and experiential learning in the local industry and organisations.\n\n    Second, in line with the culture and the traditions of FAST, the FAST MBA focuses on technology integration in its\n\n    courses. Third, the enhanced MBA is designed to integrate cases in many of its level five and six courses, thus\n\n    creating a balance between theoretical knowledge and its application on the one hand, and enhancing the technical as\n\n    well as the analytical skills of the students on the other hand.\n\nFor the award of MBA degree, a student must have:\n\n- Passed courses totaling at least 60 credit hours (through exemptions and/or by taking up a course), including\n\n        all those courses which have been specified as core courses.\n- Obtained a CGPA of at least 2.5\n\nThe FAST MBA degree does not state any specialization. However, elective courses are offered in five specializations in various campuses of FAST School of Management. The five specialization areas are:\n\n- Finance\n- HRM\n- Marketing\n- Data Analytics\n- Textile Management\n\nThe FAST MBA is a degree program which comprises of 60 credit hours for those with 16 years of education. The minimum duration for completing the FAST MBA degree is 1 ½ years, only applicable for those who have a first degree in business or related disciplines, and secure an exemption of 30 credit hours.\n\nExemption of CoursesGraduates with business degrees, equivalent to 16 years of education, such as Bachelors of Business Administration, BS Accounting and Finance, Masters in Commerce etc. may get up to 30 credit hours of exemptions, as permitted by the Higher Education Commission of Pakistan. The courses which may be exempted have an asterisk (*) next to them and are presented in bold italic in the scheme of study.\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 1 |\n| 1 | AF4001 Accounting for Managers* | 3+0 |\n| 2 | MG4004 Applied Statistics for Business* | 3+0 |\n| 3 | MG4005 Business Economics for Managers* | 3+0 |\n| 4 | MG4006 Management & Organizational Behaviour* | 3+0 |\n| 5 | MG4010 Marketing* | 3+0 |\n| Total | 15 + 0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 2 |\n| 1 | AF4009 Finance for Managers* | 3+0 |\n| 2 | MG4xxx Quantities Methods | 3+0 |\n| 3 | MG4007 Managing Human Resources* | 3+0 |\n| 4 | MG4009 Managerial Economics* | 3+0 |\n| 5 | MG5017 Advanced Research Methods | 3+0 |\n| Total | 15 + 0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 3 |\n| 1 | AF5003 Financial Reporting & Analysis | 3+0 |\n| 2 | MG5015 Strategic HR & Leadership | 3+0 |\n| 3 | MG5017 Strategic Marketing | 3+0 |\n| 4 | Elective-I | 3+0 |\n| 5 | Elective-II/Dissertation-I | 3+0 |\n| Total | 15 + 0 |\n\n| Sr. No | Course Name | Crdt Hrs. |\n| :-- | :-- | :-- |\n| Semester 4 |\n| 1 | AF5001 Applied Corporate Finance | 3+0 |\n| 2 | MG4002 Communication for Managers* | 3+0 |\n| 3 | MG5024 Cases in Management | 3+0 |\n| 4 | Elective-III | 3+0 |\n| 5 | MBA Project/Dissertation-II | 0+3 |\n| Total | 12 + 3 |\n\nNote 1:30 credits (including exemptions and the course of ARM) and CGPA of 2.50 or more.Note 2:Dissertation of 6 credit hours will be done by an individual student.Note 3:Courses with*may be exempted for graduates with business degrees. To qualify for the block exemption, a candidate must have studied at least: three courses each in management, quantitative stream, English/business communication; two courses each in accounting, finance, and marketing; one course each in economics, human resource management, and information technology. The MBA admission committee may allow upto two exemptions from the above requirements on a case by case basis.\n\nNote 1:30 credits (including exemptions and the course of ARM) and CGPA of 2.50 or more.\n\nNote 2:Dissertation of 6 credit hours will be done by an individual student.\n\nNote 3:Courses with*may be exempted for graduates with business degrees. To qualify for the block exemption, a candidate must have studied at least: three courses each in management, quantitative stream, English/business communication; two courses each in accounting, finance, and marketing; one course each in economics, human resource management, and information technology. The MBA admission committee may allow upto two exemptions from the above requirements on a case by case basis.\n\nFAST-House\n\nRohtas Road, G-9/4\n\nIslamabad - 44000", "tokens": 1005}
